{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_27", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "enc_layer0_conv1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer0_conv1", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer0_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer0_conv1_BN", "inbound_nodes": [[["enc_layer0_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer0_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer0_conv1_activation", "inbound_nodes": [[["enc_layer0_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer0_conv2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer0_conv2", "inbound_nodes": [[["enc_layer0_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer0_identity", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer0_identity", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer0_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer0_conv2_BN", "inbound_nodes": [[["enc_layer0_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "enc_layer0_conv2_residual_connection", "trainable": true, "dtype": "float32"}, "name": "enc_layer0_conv2_residual_connection", "inbound_nodes": [[["enc_layer0_identity", 0, 0, {}], ["enc_layer0_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer0_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer0_conv2_activation", "inbound_nodes": [[["enc_layer0_conv2_residual_connection", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_108", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_108", "inbound_nodes": [[["enc_layer0_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer1_conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer1_conv1", "inbound_nodes": [[["max_pooling2d_108", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer1_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer1_conv1_BN", "inbound_nodes": [[["enc_layer1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer1_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer1_conv1_activation", "inbound_nodes": [[["enc_layer1_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer1_conv2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer1_conv2", "inbound_nodes": [[["enc_layer1_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer1_identity", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer1_identity", "inbound_nodes": [[["max_pooling2d_108", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer1_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer1_conv2_BN", "inbound_nodes": [[["enc_layer1_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "enc_layer1_conv2_residual_connection", "trainable": true, "dtype": "float32"}, "name": "enc_layer1_conv2_residual_connection", "inbound_nodes": [[["enc_layer1_identity", 0, 0, {}], ["enc_layer1_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer1_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer1_conv2_activation", "inbound_nodes": [[["enc_layer1_conv2_residual_connection", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_109", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_109", "inbound_nodes": [[["enc_layer1_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer2_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer2_conv1", "inbound_nodes": [[["max_pooling2d_109", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer2_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer2_conv1_BN", "inbound_nodes": [[["enc_layer2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer2_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer2_conv1_activation", "inbound_nodes": [[["enc_layer2_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer2_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer2_conv2", "inbound_nodes": [[["enc_layer2_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer2_identity", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer2_identity", "inbound_nodes": [[["max_pooling2d_109", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer2_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer2_conv2_BN", "inbound_nodes": [[["enc_layer2_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "enc_layer2_conv2_residual_connection", "trainable": true, "dtype": "float32"}, "name": "enc_layer2_conv2_residual_connection", "inbound_nodes": [[["enc_layer2_identity", 0, 0, {}], ["enc_layer2_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer2_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer2_conv2_activation", "inbound_nodes": [[["enc_layer2_conv2_residual_connection", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_110", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_110", "inbound_nodes": [[["enc_layer2_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer3_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer3_conv1", "inbound_nodes": [[["max_pooling2d_110", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer3_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer3_conv1_BN", "inbound_nodes": [[["enc_layer3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer3_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer3_conv1_activation", "inbound_nodes": [[["enc_layer3_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer3_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer3_conv2", "inbound_nodes": [[["enc_layer3_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "enc_layer3_identity", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "enc_layer3_identity", "inbound_nodes": [[["max_pooling2d_110", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "enc_layer3_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "enc_layer3_conv2_BN", "inbound_nodes": [[["enc_layer3_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "enc_layer3_conv2_residual_connection", "trainable": true, "dtype": "float32"}, "name": "enc_layer3_conv2_residual_connection", "inbound_nodes": [[["enc_layer3_identity", 0, 0, {}], ["enc_layer3_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "enc_layer3_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "enc_layer3_conv2_activation", "inbound_nodes": [[["enc_layer3_conv2_residual_connection", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_111", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_111", "inbound_nodes": [[["enc_layer3_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "latent_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "latent_conv", "inbound_nodes": [[["max_pooling2d_111", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "latent_conv_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "latent_conv_BN", "inbound_nodes": [[["latent_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "latent_conv_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "latent_conv_activation", "inbound_nodes": [[["latent_conv_BN", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_216", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_216", "inbound_nodes": [[["latent_conv_activation", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_220", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_220", "inbound_nodes": [[["latent_conv_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_216", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_216", "inbound_nodes": [[["up_sampling2d_216", 0, 0, {}], ["enc_layer3_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_220", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_220", "inbound_nodes": [[["up_sampling2d_220", 0, 0, {}], ["enc_layer3_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer4_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer4_conv1", "inbound_nodes": [[["concatenate_216", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer4_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer4_conv1", "inbound_nodes": [[["concatenate_220", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer4_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer4_conv1_BN", "inbound_nodes": [[["dendrites_dec_layer4_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer4_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer4_conv1_BN", "inbound_nodes": [[["spines_dec_layer4_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer4_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer4_conv1_activation", "inbound_nodes": [[["dendrites_dec_layer4_conv1_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer4_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer4_conv1_activation", "inbound_nodes": [[["spines_dec_layer4_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer4_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer4_conv2", "inbound_nodes": [[["dendrites_dec_layer4_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer4_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer4_conv2", "inbound_nodes": [[["spines_dec_layer4_conv1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer4_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer4_conv2_BN", "inbound_nodes": [[["dendrites_dec_layer4_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer4_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer4_conv2_BN", "inbound_nodes": [[["spines_dec_layer4_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer4_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer4_conv2_activation", "inbound_nodes": [[["dendrites_dec_layer4_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer4_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer4_conv2_activation", "inbound_nodes": [[["spines_dec_layer4_conv2_BN", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_217", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_217", "inbound_nodes": [[["dendrites_dec_layer4_conv2_activation", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_221", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_221", "inbound_nodes": [[["spines_dec_layer4_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_217", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_217", "inbound_nodes": [[["up_sampling2d_217", 0, 0, {}], ["enc_layer2_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_221", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_221", "inbound_nodes": [[["up_sampling2d_221", 0, 0, {}], ["enc_layer2_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer3_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer3_conv1", "inbound_nodes": [[["concatenate_217", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer3_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer3_conv1", "inbound_nodes": [[["concatenate_221", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer3_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer3_conv1_BN", "inbound_nodes": [[["dendrites_dec_layer3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer3_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer3_conv1_BN", "inbound_nodes": [[["spines_dec_layer3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer3_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer3_conv1_activation", "inbound_nodes": [[["dendrites_dec_layer3_conv1_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer3_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer3_conv1_activation", "inbound_nodes": [[["spines_dec_layer3_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer3_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer3_conv2", "inbound_nodes": [[["dendrites_dec_layer3_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer3_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer3_conv2", "inbound_nodes": [[["spines_dec_layer3_conv1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer3_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer3_conv2_BN", "inbound_nodes": [[["dendrites_dec_layer3_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer3_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer3_conv2_BN", "inbound_nodes": [[["spines_dec_layer3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer3_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer3_conv2_activation", "inbound_nodes": [[["dendrites_dec_layer3_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer3_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer3_conv2_activation", "inbound_nodes": [[["spines_dec_layer3_conv2_BN", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_218", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_218", "inbound_nodes": [[["dendrites_dec_layer3_conv2_activation", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_222", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_222", "inbound_nodes": [[["spines_dec_layer3_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_218", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_218", "inbound_nodes": [[["up_sampling2d_218", 0, 0, {}], ["enc_layer1_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_222", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_222", "inbound_nodes": [[["up_sampling2d_222", 0, 0, {}], ["enc_layer1_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer2_conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer2_conv1", "inbound_nodes": [[["concatenate_218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer2_conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer2_conv1", "inbound_nodes": [[["concatenate_222", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer2_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer2_conv1_BN", "inbound_nodes": [[["dendrites_dec_layer2_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer2_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer2_conv1_BN", "inbound_nodes": [[["spines_dec_layer2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer2_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer2_conv1_activation", "inbound_nodes": [[["dendrites_dec_layer2_conv1_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer2_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer2_conv1_activation", "inbound_nodes": [[["spines_dec_layer2_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer2_conv2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer2_conv2", "inbound_nodes": [[["dendrites_dec_layer2_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer2_conv2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer2_conv2", "inbound_nodes": [[["spines_dec_layer2_conv1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer2_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer2_conv2_BN", "inbound_nodes": [[["dendrites_dec_layer2_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer2_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer2_conv2_BN", "inbound_nodes": [[["spines_dec_layer2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer2_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer2_conv2_activation", "inbound_nodes": [[["dendrites_dec_layer2_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer2_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer2_conv2_activation", "inbound_nodes": [[["spines_dec_layer2_conv2_BN", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_219", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_219", "inbound_nodes": [[["dendrites_dec_layer2_conv2_activation", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_223", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_223", "inbound_nodes": [[["spines_dec_layer2_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_219", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_219", "inbound_nodes": [[["up_sampling2d_219", 0, 0, {}], ["enc_layer0_conv2_activation", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_223", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_223", "inbound_nodes": [[["up_sampling2d_223", 0, 0, {}], ["enc_layer0_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer1_conv1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer1_conv1", "inbound_nodes": [[["concatenate_219", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer1_conv1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer1_conv1", "inbound_nodes": [[["concatenate_223", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer1_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer1_conv1_BN", "inbound_nodes": [[["dendrites_dec_layer1_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer1_conv1_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer1_conv1_BN", "inbound_nodes": [[["spines_dec_layer1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer1_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer1_conv1_activation", "inbound_nodes": [[["dendrites_dec_layer1_conv1_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer1_conv1_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer1_conv1_activation", "inbound_nodes": [[["spines_dec_layer1_conv1_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites_dec_layer1_conv2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites_dec_layer1_conv2", "inbound_nodes": [[["dendrites_dec_layer1_conv1_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines_dec_layer1_conv2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "spines_dec_layer1_conv2", "inbound_nodes": [[["spines_dec_layer1_conv1_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "dendrites_dec_layer1_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "dendrites_dec_layer1_conv2_BN", "inbound_nodes": [[["dendrites_dec_layer1_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "spines_dec_layer1_conv2_BN", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "spines_dec_layer1_conv2_BN", "inbound_nodes": [[["spines_dec_layer1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "dendrites_dec_layer1_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "dendrites_dec_layer1_conv2_activation", "inbound_nodes": [[["dendrites_dec_layer1_conv2_BN", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "spines_dec_layer1_conv2_activation", "trainable": true, "dtype": "float32", "activation": "swish"}, "name": "spines_dec_layer1_conv2_activation", "inbound_nodes": [[["spines_dec_layer1_conv2_BN", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "dendrites", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dendrites", "inbound_nodes": [[["dendrites_dec_layer1_conv2_activation", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "spines", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, 